#include <iostream>
#include <Windows.h>
int main()
{
	using namespace std;
	SetConsoleOutputCP(65001);
	SetConsoleCP(65001);



	cout << "Привіт оператор циклу for  " << endl;
	// для роботи з циклом for є синтаксис для нього
	// орератор інкременту і++ аналог і=і+1
	// оператор зменшення  на  1 декременту і -- аналг і= і-1
	// кілктість повторень визначає змінна n
	//for (ініціалізація циклу; умова ; умова циклу; умова продовження циклу)
	// sініціалізіція циклу мвиконується один раз на початку циклу
	//умова продовження циклу - виконується  на кожній ітерації 
	int n = 10;
	for (int i = 1; i <= 10; i++) // 
	{
		cout << i << "\t";
	}
	return 0;


}